In [26]:
import pandas as pd

In [27]:
# Reading the CSV file 
df_exams = pd.read_csv("StudentsPerformance.csv")
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Math Operations

## Operations in Columns

In [28]:
# Select a column that you want to add and calculate total sum 
df_exams["math score"].sum()

66089

In [29]:
# Count, Mean, std (Standard Deviation), Max, Min
print(df_exams["math score"].count())
print(df_exams["math score"].mean())
print(df_exams["math score"].sum())
print(df_exams["math score"].std())
print(df_exams["math score"].max())
print(df_exams["math score"].min())

1000
66.089
66089
15.163080096009468
100
0

In [30]:
# Easier way to calculate with .describe()
df_exams.describe().round(2)

       math score  reading score  writing score
count     1000.00        1000.00        1000.00
mean        66.09          69.17          68.05
std         15.16          14.60          15.20
min          0.00          17.00          10.00
25%         57.00          59.00          57.75
50%         66.00          70.00          69.00
75%         77.00          79.00          79.00
max        100.00         100.00         100.00

## Operations in Rows

In [31]:
# Calculating the sum in a row
df_exams["math score"] + df_exams["reading score"]	+ df_exams["writing score"]

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [32]:
# Calculating the average score and assigning the result to a new columnd
df_exams["average"] = (df_exams["math score"] + df_exams["reading score"] + df_exams["writing score"])/3

In [35]:
# Showing the dataframe
df_exams.round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.00
996,male,group C,high school,free/reduced,none,62,55,55,57.33
997,female,group C,high school,free/reduced,completed,59,71,65,65.00
998,female,group D,some college,standard,completed,68,78,77,74.33
999,female,group D,some college,free/reduced,none,77,86,86,83.00